Revit 2026 API

# GenericFormSubcategory Property

---

The subcategory.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Category Subcategory { get; set; }
```
```vb
Public Property Subcategory As Category
	Get
	Set
```
```cpp
public:
property Category^ Subcategory {
	Category^ get ();
	void set (Category^ value);
}
```
```fsharp
member Subcategory : Category with get, set
```

#### Property Value

Category

The subcategory can be set to either the family category or one of its subcategories.

#### Reference

GenericForm Class

Autodesk.Revit.DB Namespace